In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\akthu\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\akthu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\akthu\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\akthu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\akthu\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\akthu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [6]:
data = {
    'sqft' : [500,750,300,450],
    'price' : [25000,37500,15000,22500]
}

housing = pd.DataFrame(data)
housing

   sqft  price
0   500  25000
1   750  37500
2   300  15000
3   450  22500

In [7]:
housing = pd.DataFrame(data, index = ['H001', 'H002', 'H003', 'H004'])
housing

      sqft  price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [9]:
housing.loc['H003']

sqft       300
price    15000
Name: H003, dtype: int64

In [10]:
housing.loc['H001' : 'H003']

      sqft  price
H001   500  25000
H002   750  37500
H003   300  15000

In [11]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, H001 to H004
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sqft    4 non-null      int64
 1   price   4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

In [12]:
housing.shape

(4, 2)

In [15]:
housing.describe()

             sqft         price
count    4.000000      4.000000
mean   500.000000  25000.000000
std    187.082869   9354.143467
min    300.000000  15000.000000
25%    412.500000  20625.000000
50%    475.000000  23750.000000
75%    562.500000  28125.000000
max    750.000000  37500.000000

In [16]:
housing.head()

      sqft  price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [17]:
housing.tail()

      sqft  price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [18]:
housing.columns

Index(['sqft', 'price'], dtype='object')

In [19]:
housing.rename(columns = {'sqft':'Sqft', 'price':'Price'}, inplace = True)
housing

      Sqft  Price
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500

In [20]:
housing.columns = ['Size', '$']
housing

      Size      $
H001   500  25000
H002   750  37500
H003   300  15000
H004   450  22500